#!/usr/bin/env pytho      
# -*- coding: utf-8 -*-

# + 加 有浮点数参与运算则结果为浮点数
print(1 + 1)  # 输出 2
print(1 + 1.0)  # 输出 2.0

# - 减 有浮点数参与运算则结果为浮点数
print(1 - 1)  # 输出 0
print(1.0 - 1)  # 输出 0

# * 乘 有浮点数参与运算则结果为浮点数
print(2 * 2)  # 输出 4
print(2 * 2.0)  # 输出 4

# / 除 结果为浮点数
print(9 / 3)  # 输出 3
print(9 / 2)  # 输出 4.5

# // 整除 有浮点数参与运算则结果为浮点数
print(9 // 3)  # 输出 3
print(9 // 2)  # 输出 4
print(9 // 2.0)  # 输出 4.0

# % 取余 有浮点数参与运算则结果为浮点数
print(9 % 4)  # 输出 1
print(9 % 4.0)  # 输出 1.0

# ** 指数 有浮点数参与运算则结果为浮点数
print(2 ** 3)  # 输出 8
print(2.0 ** 3)  # 输出 8.0

# () 小括号 提高优先级
